{
    "experience": [
        {
            "company": "All American Asphalt ",
            "icon": "ConstructionOutlinedIcon",
            "jobTitle": "Programmer",
            "dates": "Sept. 2023 - Present",
            "description": [
                "Utilized Microsoft Technology Stack to maintain an enterprise class software application which handles major business processes.",
                "Developed new functionality within the enterprise Windows Forms application using C#. The application interfaces with an Informix database.",
                "Utilized AWS to integrate login features within an internal web application. Leveraged Amazon Cognito to handle identity services such as OAuth 2.0",
                "Performed needed server maintenance via command line within Linux, executed needed database imports and generated backups as needed."
            ]
        },
        {
            "company": "San Manuel Casino",
            "icon": "CasinoIcon",
            "jobTitle": "Software Engineer",
            "dates": "Jun. 2018 - Feb. 2022",
            "description": [
                "Coordinated and collaborated with other engineers on various projects including APIs, Cloud Development, Mobile Applications, and Web Applications.",
                "Developed, tested, debugged and documented programs and applications using primarily C#.",
                "Primary developer on a series of projects including improvements to onboarding processes by performing various integrations with Workday. Integrations included daily roster pulls from the Workday system, as well as syncing this information within Active Directory.",
                "Worked with vendors to complete deliverables."
            ]
        },
        {
            "company": "Megasys Inc.",
            "icon": "RequestQuoteIcon",
            "jobTitle": "Software Developer",
            "dates": "Jul. 2017 ‑ Jun. 2018",
            "description": [
                "Developed, tested and debugged various features for Megasys' flagship car financing web application.",
                "Utilized the Microsoft Technology Stack including C#, Microsoft SQL Server, and various web frameworks to deliver features.",
                "Integrated various services within the web application using RESTful API."
            ]
        }
    ]
}
